let data={
    alldata:[
        {
            id:1,
            src:"./img/mp1.jpg",
            name:"反贪风暴3",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:2,
            src:"./img/mp2.jpg",
            name:"碟中谍6：全面瓦解",
            introduction:"动作，冒险，惊悚",
            actor:"主演：汤姆·克鲁斯，亨利·卡威尔",
            address:"今天194家电影院放映1974场",
            mark:"8.9",
            buy:"预售",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:3,
            src:"./img/mp3.jpg",
            name:"镰仓物语",
            introduction:"剧情奇幻",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:4,
            src:"./img/mp4.jpg",
            name:"黄金兄弟",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"预售",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:5,
            src:"./img/mp1.jpg",
            name:"里茶的姑妈",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"预售",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:6,
            src:"./img/mp2.jpg",
            name:"反贪风暴2",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:7,
            src:"./img/mp3.jpg",
            name:"反贪风暴",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:8,
            src:"./img/mp4.jpg",
            name:"黄金兄弟2",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:9,
            src:"./img/mp1.jpg",
            name:"黄金瞳",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:10,
            src:"./img/mp2.jpg",
            name:"成龙历险记",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:11,
            src:"./img/mp3.jpg",
            name:"成龙历险记2",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:12,
            src:"./img/mp4.jpg",
            name:"澳洲风云3",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        },{
            id:13,
            src:"./img/mp1.jpg",
            name:"澳洲风云2",
            introduction:"剧情，动作，犯罪",
            actor:"主演：古天乐，张智霖，郑嘉颖",
            address:"今天197家电影院放映2473场",
            mark:"8.9",
            buy:"购票",
            tail:{
                con:"ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)ICAC(廉政公署) 陆志谦 (古天乐 饰)，JFIU(联合财富情报组) 刘宝强 (张智霖 饰) 分别侦查贪污及洗黑钱案，但苦无线索，这时廉政公署L组(内部记录)"
            }
        }
    ],
    blurlist:[]
}
let movielist=(state=data,action)=>{
    switch(action.type){
        case "PUSH":{
            state.blurlist.push(action.obj)
            return state
        }
        case "CHANGE":{
            state.blurlist=[];
            return state;
        }
        case "CHANGES":{
            console.log(1)
            state.blurlist=[];
            return state;
        }
        default:
            return state
    }
}
export default movielist